Microchip-MPLAB-Harmony/csp/apps/spi/spi_self_loopback_blocking/firmware/src/packs/ATSAMA5D27_DFP/component/pmc.h
/**
 * \brief Component description for PMC
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-01-23T22:42:14Z */
#ifndef _SAMA5D2_PMC_COMPONENT_H_
#define _SAMA5D2_PMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PMC                                          */
/* ************************************************************************** */

/* -------- PMC_SCER : (PMC Offset: 0x00) ( /W 32) System Clock Enable Register -------- */
#define PMC_SCER_DDRCK_Pos                    _U_(2)                                               /**< (PMC_SCER) DDR Clock Enable Position */
#define PMC_SCER_DDRCK_Msk                    (_U_(0x1) << PMC_SCER_DDRCK_Pos)                     /**< (PMC_SCER) DDR Clock Enable Mask */
#define PMC_SCER_DDRCK(value)                 (PMC_SCER_DDRCK_Msk & ((value) << PMC_SCER_DDRCK_Pos))
#define PMC_SCER_LCDCK_Pos                    _U_(3)                                               /**< (PMC_SCER) MCK2x Clock Enable Position */
#define PMC_SCER_LCDCK_Msk                    (_U_(0x1) << PMC_SCER_LCDCK_Pos)                     /**< (PMC_SCER) MCK2x Clock Enable Mask */
#define PMC_SCER_LCDCK(value)                 (PMC_SCER_LCDCK_Msk & ((value) << PMC_SCER_LCDCK_Pos))
#define PMC_SCER_UHP_Pos                      _U_(6)                                               /**< (PMC_SCER) USB Host OHCI Clocks Enable Position */
#define PMC_SCER_UHP_Msk                      (_U_(0x1) << PMC_SCER_UHP_Pos)                       /**< (PMC_SCER) USB Host OHCI Clocks Enable Mask */
#define PMC_SCER_UHP(value)                   (PMC_SCER_UHP_Msk & ((value) << PMC_SCER_UHP_Pos))  
#define PMC_SCER_UDP_Pos                      _U_(7)                                               /**< (PMC_SCER) USB Device Clock Enable Position */
#define PMC_SCER_UDP_Msk                      (_U_(0x1) << PMC_SCER_UDP_Pos)                       /**< (PMC_SCER) USB Device Clock Enable Mask */
#define PMC_SCER_UDP(value)                   (PMC_SCER_UDP_Msk & ((value) << PMC_SCER_UDP_Pos))  
#define PMC_SCER_PCK0_Pos                     _U_(8)                                               /**< (PMC_SCER) Programmable Clock 0 Output Enable Position */
#define PMC_SCER_PCK0_Msk                     (_U_(0x1) << PMC_SCER_PCK0_Pos)                      /**< (PMC_SCER) Programmable Clock 0 Output Enable Mask */
#define PMC_SCER_PCK0(value)                  (PMC_SCER_PCK0_Msk & ((value) << PMC_SCER_PCK0_Pos))
#define PMC_SCER_PCK1_Pos                     _U_(9)                                               /**< (PMC_SCER) Programmable Clock 1 Output Enable Position */
#define PMC_SCER_PCK1_Msk                     (_U_(0x1) << PMC_SCER_PCK1_Pos)                      /**< (PMC_SCER) Programmable Clock 1 Output Enable Mask */
#define PMC_SCER_PCK1(value)                  (PMC_SCER_PCK1_Msk & ((value) << PMC_SCER_PCK1_Pos))
#define PMC_SCER_PCK2_Pos                     _U_(10)                                              /**< (PMC_SCER) Programmable Clock 2 Output Enable Position */
#define PMC_SCER_PCK2_Msk                     (_U_(0x1) << PMC_SCER_PCK2_Pos)                      /**< (PMC_SCER) Programmable Clock 2 Output Enable Mask */
#define PMC_SCER_PCK2(value)                  (PMC_SCER_PCK2_Msk & ((value) << PMC_SCER_PCK2_Pos))
#define PMC_SCER_ISCCK_Pos                    _U_(18)                                              /**< (PMC_SCER) ISC Clock Enable Position */
#define PMC_SCER_ISCCK_Msk                    (_U_(0x1) << PMC_SCER_ISCCK_Pos)                     /**< (PMC_SCER) ISC Clock Enable Mask */
#define PMC_SCER_ISCCK(value)                 (PMC_SCER_ISCCK_Msk & ((value) << PMC_SCER_ISCCK_Pos))
#define PMC_SCER_Msk                          _U_(0x000407CC)                                      /**< (PMC_SCER) Register Mask  */

#define PMC_SCER_PCK_Pos                      _U_(8)                                               /**< (PMC_SCER Position) Programmable Clock x Output Enable */
#define PMC_SCER_PCK_Msk                      (_U_(0x7) << PMC_SCER_PCK_Pos)                       /**< (PMC_SCER Mask) PCK */
#define PMC_SCER_PCK(value)                   (PMC_SCER_PCK_Msk & ((value) << PMC_SCER_PCK_Pos))   

/* -------- PMC_SCDR : (PMC Offset: 0x04) ( /W 32) System Clock Disable Register -------- */
#define PMC_SCDR_PCK_Pos                      _U_(0)                                               /**< (PMC_SCDR) Processor Clock Disable Position */
#define PMC_SCDR_PCK_Msk                      (_U_(0x1) << PMC_SCDR_PCK_Pos)                       /**< (PMC_SCDR) Processor Clock Disable Mask */
#define PMC_SCDR_PCK(value)                   (PMC_SCDR_PCK_Msk & ((value) << PMC_SCDR_PCK_Pos))  
#define PMC_SCDR_DDRCK_Pos                    _U_(2)                                               /**< (PMC_SCDR) DDR Clock Disable Position */
#define PMC_SCDR_DDRCK_Msk                    (_U_(0x1) << PMC_SCDR_DDRCK_Pos)                     /**< (PMC_SCDR) DDR Clock Disable Mask */
#define PMC_SCDR_DDRCK(value)                 (PMC_SCDR_DDRCK_Msk & ((value) << PMC_SCDR_DDRCK_Pos))
#define PMC_SCDR_LCDCK_Pos                    _U_(3)                                               /**< (PMC_SCDR) MCK2x Clock Disable Position */
#define PMC_SCDR_LCDCK_Msk                    (_U_(0x1) << PMC_SCDR_LCDCK_Pos)                     /**< (PMC_SCDR) MCK2x Clock Disable Mask */
#define PMC_SCDR_LCDCK(value)                 (PMC_SCDR_LCDCK_Msk & ((value) << PMC_SCDR_LCDCK_Pos))
#define PMC_SCDR_UHP_Pos                      _U_(6)                                               /**< (PMC_SCDR) USB Host OHCI Clock Disable Position */
#define PMC_SCDR_UHP_Msk                      (_U_(0x1) << PMC_SCDR_UHP_Pos)                       /**< (PMC_SCDR) USB Host OHCI Clock Disable Mask */
#define PMC_SCDR_UHP(value)                   (PMC_SCDR_UHP_Msk & ((value) << PMC_SCDR_UHP_Pos))  
#define PMC_SCDR_UDP_Pos                      _U_(7)                                               /**< (PMC_SCDR) USB Device Clock Enable Position */
#define PMC_SCDR_UDP_Msk                      (_U_(0x1) << PMC_SCDR_UDP_Pos)                       /**< (PMC_SCDR) USB Device Clock Enable Mask */
#define PMC_SCDR_UDP(value)                   (PMC_SCDR_UDP_Msk & ((value) << PMC_SCDR_UDP_Pos))  
#define PMC_SCDR_PCK0_Pos                     _U_(8)                                               /**< (PMC_SCDR) Programmable Clock 0 Output Disable Position */
#define PMC_SCDR_PCK0_Msk                     (_U_(0x1) << PMC_SCDR_PCK0_Pos)                      /**< (PMC_SCDR) Programmable Clock 0 Output Disable Mask */
#define PMC_SCDR_PCK0(value)                  (PMC_SCDR_PCK0_Msk & ((value) << PMC_SCDR_PCK0_Pos))
#define PMC_SCDR_PCK1_Pos                     _U_(9)                                               /**< (PMC_SCDR) Programmable Clock 1 Output Disable Position */
#define PMC_SCDR_PCK1_Msk                     (_U_(0x1) << PMC_SCDR_PCK1_Pos)                      /**< (PMC_SCDR) Programmable Clock 1 Output Disable Mask */
#define PMC_SCDR_PCK1(value)                  (PMC_SCDR_PCK1_Msk & ((value) << PMC_SCDR_PCK1_Pos))
#define PMC_SCDR_PCK2_Pos                     _U_(10)                                              /**< (PMC_SCDR) Programmable Clock 2 Output Disable Position */
#define PMC_SCDR_PCK2_Msk                     (_U_(0x1) << PMC_SCDR_PCK2_Pos)                      /**< (PMC_SCDR) Programmable Clock 2 Output Disable Mask */
#define PMC_SCDR_PCK2(value)                  (PMC_SCDR_PCK2_Msk & ((value) << PMC_SCDR_PCK2_Pos))
#define PMC_SCDR_ISCCK_Pos                    _U_(18)                                              /**< (PMC_SCDR) ISC Clock Disable Position */
#define PMC_SCDR_ISCCK_Msk                    (_U_(0x1) << PMC_SCDR_ISCCK_Pos)                     /**< (PMC_SCDR) ISC Clock Disable Mask */
#define PMC_SCDR_ISCCK(value)                 (PMC_SCDR_ISCCK_Msk & ((value) << PMC_SCDR_ISCCK_Pos))
#define PMC_SCDR_Msk                          _U_(0x000407CD)                                      /**< (PMC_SCDR) Register Mask  */


