Microchip-MPLAB-Harmony/csp/apps/spi/spi_self_loopback_blocking/firmware/src/packs/ATSAMA5D27_DFP/component/pmc.h
/* -------- PMC_AUDIO_PLL0 : (PMC Offset: 0x14C) (R/W 32) Audio PLL Register 0 -------- */
#define PMC_AUDIO_PLL0_PLLEN_Pos              _U_(0)                                               /**< (PMC_AUDIO_PLL0) PLL Enable Position */
#define PMC_AUDIO_PLL0_PLLEN_Msk              (_U_(0x1) << PMC_AUDIO_PLL0_PLLEN_Pos)               /**< (PMC_AUDIO_PLL0) PLL Enable Mask */
#define PMC_AUDIO_PLL0_PLLEN(value)           (PMC_AUDIO_PLL0_PLLEN_Msk & ((value) << PMC_AUDIO_PLL0_PLLEN_Pos))
#define PMC_AUDIO_PLL0_PADEN_Pos              _U_(1)                                               /**< (PMC_AUDIO_PLL0) Pad Clock Enable Position */
#define PMC_AUDIO_PLL0_PADEN_Msk              (_U_(0x1) << PMC_AUDIO_PLL0_PADEN_Pos)               /**< (PMC_AUDIO_PLL0) Pad Clock Enable Mask */
#define PMC_AUDIO_PLL0_PADEN(value)           (PMC_AUDIO_PLL0_PADEN_Msk & ((value) << PMC_AUDIO_PLL0_PADEN_Pos))
#define PMC_AUDIO_PLL0_PMCEN_Pos              _U_(2)                                               /**< (PMC_AUDIO_PLL0) PMC Clock Enable Position */
#define PMC_AUDIO_PLL0_PMCEN_Msk              (_U_(0x1) << PMC_AUDIO_PLL0_PMCEN_Pos)               /**< (PMC_AUDIO_PLL0) PMC Clock Enable Mask */
#define PMC_AUDIO_PLL0_PMCEN(value)           (PMC_AUDIO_PLL0_PMCEN_Msk & ((value) << PMC_AUDIO_PLL0_PMCEN_Pos))
#define PMC_AUDIO_PLL0_RESETN_Pos             _U_(3)                                               /**< (PMC_AUDIO_PLL0) Audio PLL Reset Position */
#define PMC_AUDIO_PLL0_RESETN_Msk             (_U_(0x1) << PMC_AUDIO_PLL0_RESETN_Pos)              /**< (PMC_AUDIO_PLL0) Audio PLL Reset Mask */
#define PMC_AUDIO_PLL0_RESETN(value)          (PMC_AUDIO_PLL0_RESETN_Msk & ((value) << PMC_AUDIO_PLL0_RESETN_Pos))
#define PMC_AUDIO_PLL0_PLLFLT_Pos             _U_(4)                                               /**< (PMC_AUDIO_PLL0) PLL Loop Filter Selection Position */
#define PMC_AUDIO_PLL0_PLLFLT_Msk             (_U_(0xF) << PMC_AUDIO_PLL0_PLLFLT_Pos)              /**< (PMC_AUDIO_PLL0) PLL Loop Filter Selection Mask */
#define PMC_AUDIO_PLL0_PLLFLT(value)          (PMC_AUDIO_PLL0_PLLFLT_Msk & ((value) << PMC_AUDIO_PLL0_PLLFLT_Pos))
#define PMC_AUDIO_PLL0_ND_Pos                 _U_(8)                                               /**< (PMC_AUDIO_PLL0) Loop Divider Ratio Position */
#define PMC_AUDIO_PLL0_ND_Msk                 (_U_(0x7F) << PMC_AUDIO_PLL0_ND_Pos)                 /**< (PMC_AUDIO_PLL0) Loop Divider Ratio Mask */
#define PMC_AUDIO_PLL0_ND(value)              (PMC_AUDIO_PLL0_ND_Msk & ((value) << PMC_AUDIO_PLL0_ND_Pos))
#define PMC_AUDIO_PLL0_QDPMC_Pos              _U_(16)                                              /**< (PMC_AUDIO_PLL0) Output Divider Ratio for PMC Clock Position */
#define PMC_AUDIO_PLL0_QDPMC_Msk              (_U_(0x7F) << PMC_AUDIO_PLL0_QDPMC_Pos)              /**< (PMC_AUDIO_PLL0) Output Divider Ratio for PMC Clock Mask */
#define PMC_AUDIO_PLL0_QDPMC(value)           (PMC_AUDIO_PLL0_QDPMC_Msk & ((value) << PMC_AUDIO_PLL0_QDPMC_Pos))
#define PMC_AUDIO_PLL0_DCO_FILTER_Pos         _U_(24)                                              /**< (PMC_AUDIO_PLL0) Digitally Controlled Oscillator Filter Selection Position */
#define PMC_AUDIO_PLL0_DCO_FILTER_Msk         (_U_(0xF) << PMC_AUDIO_PLL0_DCO_FILTER_Pos)          /**< (PMC_AUDIO_PLL0) Digitally Controlled Oscillator Filter Selection Mask */
#define PMC_AUDIO_PLL0_DCO_FILTER(value)      (PMC_AUDIO_PLL0_DCO_FILTER_Msk & ((value) << PMC_AUDIO_PLL0_DCO_FILTER_Pos))
#define PMC_AUDIO_PLL0_DCO_GAIN_Pos           _U_(28)                                              /**< (PMC_AUDIO_PLL0) Digitally Controlled Oscillator Gain Selection Position */
#define PMC_AUDIO_PLL0_DCO_GAIN_Msk           (_U_(0x3) << PMC_AUDIO_PLL0_DCO_GAIN_Pos)            /**< (PMC_AUDIO_PLL0) Digitally Controlled Oscillator Gain Selection Mask */
#define PMC_AUDIO_PLL0_DCO_GAIN(value)        (PMC_AUDIO_PLL0_DCO_GAIN_Msk & ((value) << PMC_AUDIO_PLL0_DCO_GAIN_Pos))
#define PMC_AUDIO_PLL0_Msk                    _U_(0x3F7F7FFF)                                      /**< (PMC_AUDIO_PLL0) Register Mask  */


/* -------- PMC_AUDIO_PLL1 : (PMC Offset: 0x150) (R/W 32) Audio PLL Register 1 -------- */
#define PMC_AUDIO_PLL1_FRACR_Pos              _U_(0)                                               /**< (PMC_AUDIO_PLL1) Fractional Loop Divider Setting Position */
#define PMC_AUDIO_PLL1_FRACR_Msk              (_U_(0x3FFFFF) << PMC_AUDIO_PLL1_FRACR_Pos)          /**< (PMC_AUDIO_PLL1) Fractional Loop Divider Setting Mask */
#define PMC_AUDIO_PLL1_FRACR(value)           (PMC_AUDIO_PLL1_FRACR_Msk & ((value) << PMC_AUDIO_PLL1_FRACR_Pos))
#define PMC_AUDIO_PLL1_DIV_Pos                _U_(24)                                              /**< (PMC_AUDIO_PLL1) Divider Value Position */
#define PMC_AUDIO_PLL1_DIV_Msk                (_U_(0x3) << PMC_AUDIO_PLL1_DIV_Pos)                 /**< (PMC_AUDIO_PLL1) Divider Value Mask */
#define PMC_AUDIO_PLL1_DIV(value)             (PMC_AUDIO_PLL1_DIV_Msk & ((value) << PMC_AUDIO_PLL1_DIV_Pos))
#define   PMC_AUDIO_PLL1_DIV_DIV2_Val         _U_(0x2)                                             /**< (PMC_AUDIO_PLL1) Divide by 2  */
#define   PMC_AUDIO_PLL1_DIV_DIV3_Val         _U_(0x3)                                             /**< (PMC_AUDIO_PLL1) Divide by 3  */
#define PMC_AUDIO_PLL1_DIV_DIV2               (PMC_AUDIO_PLL1_DIV_DIV2_Val << PMC_AUDIO_PLL1_DIV_Pos) /**< (PMC_AUDIO_PLL1) Divide by 2 Position  */
#define PMC_AUDIO_PLL1_DIV_DIV3               (PMC_AUDIO_PLL1_DIV_DIV3_Val << PMC_AUDIO_PLL1_DIV_Pos) /**< (PMC_AUDIO_PLL1) Divide by 3 Position  */
#define PMC_AUDIO_PLL1_QDAUDIO_Pos            _U_(26)                                              /**< (PMC_AUDIO_PLL1) Output Divider Ratio for Pad Clock Position */
#define PMC_AUDIO_PLL1_QDAUDIO_Msk            (_U_(0x1F) << PMC_AUDIO_PLL1_QDAUDIO_Pos)            /**< (PMC_AUDIO_PLL1) Output Divider Ratio for Pad Clock Mask */
#define PMC_AUDIO_PLL1_QDAUDIO(value)         (PMC_AUDIO_PLL1_QDAUDIO_Msk & ((value) << PMC_AUDIO_PLL1_QDAUDIO_Pos))
#define PMC_AUDIO_PLL1_Msk                    _U_(0x7F3FFFFF)                                      /**< (PMC_AUDIO_PLL1) Register Mask  */


/** \brief PMC register offsets definitions */
#define PMC_SCER_REG_OFST              (0x00)              /**< (PMC_SCER) System Clock Enable Register Offset */
#define PMC_SCDR_REG_OFST              (0x04)              /**< (PMC_SCDR) System Clock Disable Register Offset */
#define PMC_SCSR_REG_OFST              (0x08)              /**< (PMC_SCSR) System Clock Status Register Offset */
#define PMC_PCER0_REG_OFST             (0x10)              /**< (PMC_PCER0) Peripheral Clock Enable Register 0 Offset */
#define PMC_PCDR0_REG_OFST             (0x14)              /**< (PMC_PCDR0) Peripheral Clock Disable Register 0 Offset */
#define PMC_PCSR0_REG_OFST             (0x18)              /**< (PMC_PCSR0) Peripheral Clock Status Register 0 Offset */
#define CKGR_UCKR_REG_OFST             (0x1C)              /**< (CKGR_UCKR) UTMI Clock Register Offset */
#define CKGR_MOR_REG_OFST              (0x20)              /**< (CKGR_MOR) Main Oscillator Register Offset */
#define CKGR_MCFR_REG_OFST             (0x24)              /**< (CKGR_MCFR) Main Clock Frequency Register Offset */
#define CKGR_PLLAR_REG_OFST            (0x28)              /**< (CKGR_PLLAR) PLLA Register Offset */
#define PMC_MCKR_REG_OFST              (0x30)              /**< (PMC_MCKR) Master Clock Register Offset */
#define PMC_USB_REG_OFST               (0x38)              /**< (PMC_USB) USB Clock Register Offset */
#define PMC_PCK_REG_OFST               (0x40)              /**< (PMC_PCK) Programmable Clock 0 Register Offset */
#define PMC_IER_REG_OFST               (0x60)              /**< (PMC_IER) Interrupt Enable Register Offset */
#define PMC_IDR_REG_OFST               (0x64)              /**< (PMC_IDR) Interrupt Disable Register Offset */
#define PMC_SR_REG_OFST                (0x68)              /**< (PMC_SR) Status Register Offset */
#define PMC_IMR_REG_OFST               (0x6C)              /**< (PMC_IMR) Interrupt Mask Register Offset */
#define PMC_FSMR_REG_OFST              (0x70)              /**< (PMC_FSMR) Fast Startup Mode Register Offset */
#define PMC_FSPR_REG_OFST              (0x74)              /**< (PMC_FSPR) Fast Startup Polarity Register Offset */
#define PMC_FOCR_REG_OFST              (0x78)              /**< (PMC_FOCR) Fault Output Clear Register Offset */
#define PMC_PLLICPR_REG_OFST           (0x80)              /**< (PMC_PLLICPR) PLL Charge Pump Current Register Offset */
#define PMC_WPMR_REG_OFST              (0xE4)              /**< (PMC_WPMR) Write ProtectIon Mode Register Offset */
#define PMC_WPSR_REG_OFST              (0xE8)              /**< (PMC_WPSR) Write Protection Status Register Offset */
#define PMC_PCER1_REG_OFST             (0x100)             /**< (PMC_PCER1) Peripheral Clock Enable Register 1 Offset */
#define PMC_PCDR1_REG_OFST             (0x104)             /**< (PMC_PCDR1) Peripheral Clock Disable Register 1 Offset */
#define PMC_PCSR1_REG_OFST             (0x108)             /**< (PMC_PCSR1) Peripheral Clock Status Register 1 Offset */
#define PMC_PCR_REG_OFST               (0x10C)             /**< (PMC_PCR) Peripheral Control Register Offset */
#define PMC_OCR_REG_OFST               (0x110)             /**< (PMC_OCR) Oscillator Calibration Register Offset */
#define PMC_SLPWK_ER0_REG_OFST         (0x114)             /**< (PMC_SLPWK_ER0) SleepWalking Enable Register 0 Offset */
#define PMC_SLPWK_DR0_REG_OFST         (0x118)             /**< (PMC_SLPWK_DR0) SleepWalking Disable Register 0 Offset */
#define PMC_SLPWK_SR0_REG_OFST         (0x11C)             /**< (PMC_SLPWK_SR0) SleepWalking Status Register 0 Offset */
#define PMC_SLPWK_ASR0_REG_OFST        (0x120)             /**< (PMC_SLPWK_ASR0) SleepWalking Activity Status Register 0 Offset */
#define PMC_SLPWK_ER1_REG_OFST         (0x134)             /**< (PMC_SLPWK_ER1) SleepWalking Enable Register 1 Offset */
#define PMC_SLPWK_DR1_REG_OFST         (0x138)             /**< (PMC_SLPWK_DR1) SleepWalking Disable Register 1 Offset */
#define PMC_SLPWK_SR1_REG_OFST         (0x13C)             /**< (PMC_SLPWK_SR1) SleepWalking Status Register 1 Offset */
#define PMC_SLPWK_ASR1_REG_OFST        (0x140)             /**< (PMC_SLPWK_ASR1) SleepWalking Activity Status Register 1 Offset */
#define PMC_SLPWK_AIPR_REG_OFST        (0x144)             /**< (PMC_SLPWK_AIPR) SleepWalking Activity In Progress Register Offset */
#define PMC_SLPWKCR_REG_OFST           (0x148)             /**< (PMC_SLPWKCR) SleepWalking Control Register Offset */
#define PMC_AUDIO_PLL0_REG_OFST        (0x14C)             /**< (PMC_AUDIO_PLL0) Audio PLL Register 0 Offset */
#define PMC_AUDIO_PLL1_REG_OFST        (0x150)             /**< (PMC_AUDIO_PLL1) Audio PLL Register 1 Offset */

